Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core0.xml
        <register>
          <name>LP_HINT0</name>
          <description>Low-Power Hints 0</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_FLEXCOMM0_B_LPHINT</name>
              <description>LP_FLEXCOMM0 Bus Clock Related Logic Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM1_B_LPHINT</name>
              <description>LP_FLEXCOMM1 Bus Clock Related Logic Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM2_B_LPHINT</name>
              <description>LP_FLEXCOMM2 Bus Clock Related Logic Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM3_B_LPHINT</name>
              <description>LP_FLEXCOMM3 Bus Clock Related Logic Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM4_B_LPHINT</name>
              <description>LP_FLEXCOMM4 Bus Clock Related Logic Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM5_B_LPHINT</name>
              <description>LP_FLEXCOMM5 Bus Clock Related Logic Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM6_B_LPHINT</name>
              <description>LP_FLEXCOMM6 Bus Clock Related Logic Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM7_B_LPHINT</name>
              <description>LP_FLEXCOMM7 Bus Clock Related Logic Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM8_B_LPHINT</name>
              <description>LP_FLEXCOMM8 Bus Clock Related Logic Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM9_B_LPHINT</name>
              <description>LP_FLEXCOMM9 Bus Clock Related Logic Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM10_B_LPHINT</name>
              <description>LP_FLEXCOMM10 Bus Clock Related Logic Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM11_B_LPHINT</name>
              <description>LP_FLEXCOMM11 Bus Clock Related Logic Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM12_B_LPHINT</name>
              <description>LP_FLEXCOMM12 Bus Clock Related Logic Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM13_B_LPHINT</name>
              <description>LP_FLEXCOMM13 Bus Clock Related Logic Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14_B_LPHINT</name>
              <description>LPSPI14 Bus Clock Related Logic Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16_B_LPHINT</name>
              <description>LPSPI16 Bus Clock Related Logic Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM0_F_LPHINT</name>
              <description>LP_FLEXCOMM0 Function Clock Related Logic Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM1_F_LPHINT</name>
              <description>LP_FLEXCOMM1 Function Clock Related Logic Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM2_F_LPHINT</name>
              <description>LP_FLEXCOMM2 Function Clock Related Logic Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM3_F_LPHINT</name>
              <description>LP_FLEXCOMM3 Function Clock Related Logic Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM4_F_LPHINT</name>
              <description>LP_FLEXCOMM4 Function Clock Related Logic Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM5_F_LPHINT</name>
              <description>LP_FLEXCOMM5 Function Clock Related Logic Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM6_F_LPHINT</name>
              <description>LP_FLEXCOMM6 Function Clock Related Logic Status</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM7_F_LPHINT</name>
              <description>LP_FLEXCOMM7 Function Clock Related Logic Status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM8_F_LPHINT</name>
              <description>LP_FLEXCOMM8 Function Clock Related Logic Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM9_F_LPHINT</name>
              <description>LP_FLEXCOMM9 Function Clock Related Logic Status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM10_F_LPHINT</name>
              <description>LP_FLEXCOMM10 Function Clock Related Logic Status</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM11_F_LPHINT</name>
              <description>LP_FLEXCOMM11 Function Clock Related Logic Status</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM12_F_LPHINT</name>
              <description>LP_FLEXCOMM12 Function Clock Related Logic Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM13_F_LPHINT</name>
              <description>LP_FLEXCOMM13 Function Clock Related Logic Status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14_F_LPHINT</name>
              <description>LPSPI14 Function Clock Related Logic Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QINACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QACTIVE</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16_F_LPHINT</name>
              <description>LPSPI16 Function Clock Related Logic Status</description>
              <bitOffset>31</bitOffset>
