Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core0.xml
        <register>
          <name>HW_OCOTP_MASK_CTRL1</name>
          <description>OTP Controller Mask Ctrl1 Register</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMEOUT_COUNTER</name>
              <description>De-asserted cycle number of apb_ready.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMEOUT_COUNTER_EN</name>
              <description>Enable of timeout counter feature.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_PBRICK_ERR</name>
              <description>Used for mask NONMASK_PBRICK_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_OTP_STATE_ERR</name>
              <description>Used for mask NONMASK_OTP_STATE_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_DED_RELOAD</name>
              <description>Used for mask NONMASK_DED_RELOAD bit in NONMASK_STATUS1 register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_DED</name>
              <description>Used for mask NONMASK_DED bit in NONMASK_STATUS1 register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_SEC_RELOAD</name>
              <description>Used for mask NONMASK_SEC_RELOAD bit in NONMASK_STATUS1 register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_SEC</name>
              <description>Used for mask NONMASK_SEC bit in NONMASK_STATUS1 register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_CRC_DONE</name>
              <description>Used for mask NONMASK_CRC_DONE bit in NONMASK_STATUS1 register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_CRC_LUT_SEL_ERR</name>
              <description>Used for mask NONMASK_CRC_LUT_SEL_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_CRC_ADDRESS_RANGE_ERR</name>
              <description>Used for mask NONMASK_CRC_ADDRESS_RANGE_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_CRC_WRITE_PROTECT_ERR</name>
              <description>Used for mask NONMASK_CRC_WRITE_PROTECT_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_CRC_SECURTY_PROTECT_ERR</name>
              <description>Used for mask NONMASK_CRC_SECURTY_PROTECT_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_WRITE_ERR</name>
              <description>Used for mask NONMASK_WRITE_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_LOAD_ERR</name>
              <description>Used for mask NONMASK_LOAD_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_COUNTER_ERR</name>
              <description>Used for mask NONMASK_COUNTER_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_BITPROTECT_ERR</name>
              <description>Used for mask NONMASK_BITPROTECT_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_PRNG_O_FAULT</name>
              <description>Used for mask NONMASK_PRNG_O_FAULT bit in NONMASK_STATUS1 register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_ECC_ZEROIZED_ERR</name>
              <description>Used for mask NONMASK_ECC_ZEROIZED_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_FUSE_ACCESS_ERR</name>
              <description>Used for mask NONMASK_FUSE_ACCESS_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_RELOAD_REQ_ERR</name>
              <description>Used for mask NONMASK_RELOAD_REQ_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_WRITE_DURING_RELOAD_ERR</name>
              <description>Used for mask NONMASK_WRITE_DURING_RELOAD_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_SHADOW_HVF_READ_ERR</name>
              <description>Used for mask NONMASK_SHADOW_HVF_READ_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_SHADOW_HVF_WRITE_ERR</name>
              <description>Used for mask NONMASK_SHADOW_HVF_WRITE_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_SHADOW_SRAM_READ_ERR</name>
              <description>Used for mask NONMASK_SHADOW_SRAM_READ_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_SHADOW_SRAM_WRITE_ERR</name>
              <description>Used for mask NONMASK_SHADOW_SRAM_WRITE_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_FUSE_READ_ERR</name>
              <description>Used for mask NONMASK_FUSE_READ_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_FUSE_PROG_ERR</name>
              <description>Used for mask NONMASK_FUSE_PROG_ERR bit in NONMASK_STATUS1 register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_MASK_SHADOW_NO_ACCESS</name>
              <description>Used for mask NONMASK_SHADOW_NO_ACCESS bit in NONMASK_STATUS1 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_OCOTP_MASK_STATUS1</name>
          <description>OTP Controller Nonmask Status1 Register</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASK_PBRICK_ERR</name>
              <description>Asserted if ctrl_ocotp_nxp_zeroization_mask_fuse_wp and ctrl_ocotp_nxp_zeroization_mask_fuse_wp_n are both 0/1 OR ctrl_ocotp_oem_zeroization_mask_wp and ctrl_ocotp_oem_zeroization_mask_wp_n are both 0/1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_OTP_STATE_ERR</name>
              <description>Asserted if state machine go to invalid state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DED_RELOAD</name>
              <description>OTP DED status during reload process.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_DED</name>
              <description>OTP DED status during read operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_RELOAD</name>
              <description>OTP SEC status during reload process.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_SEC</name>
              <description>OTP SEC status during read operation.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_CRC_DONE</name>
              <description>Asserted if CRC done.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_CRC_LUT_SEL_ERR</name>
              <description>Asserted if CRC_LUT_SEL bits in CRC_CTRL register is out range ([1,8]) when CRC_RUN bit in CRC_CTRL register is set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_CRC_ADDRESS_RANGE_ERR</name>
              <description>Asserted if CRC_START_ADDR and CRC_END_ADDR bits in associated CRC_LUT register is out of range, both CRC_END_ADDR is smaller than CRC_START_ADDR OR CRC_SATRT_ADDR is larger than 124 OR CRC_END_ADDR is larger than 128 will cause out of range</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_CRC_WRITE_PROTECT_ERR</name>
              <description>Asserted if write access occurs when WRITE PROTECTION bit in associated CRC_LUT register is set.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_CRC_SECURTY_PROTECT_ERR</name>
              <description>Asserted if not in secured state when SECURITY PROTECTION bit in associated CRC_LUT register is set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_WRITE_ERR</name>
              <description>Asserted if write glitch is detected.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_LOAD_ERR</name>
              <description>Asserted if load glitch is detected.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_COUNTER_ERR</name>
              <description>Asserted if load counter is not equal to fuse word number when load finished.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_BITPROTECT_ERR</name>
              <description>Asserted if bit protect error is generated.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_PRNG_O_FAULT</name>
              <description>Asserted if output signal o_default of prng module is not equal to 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_ECC_ZEROIZED_ERR</name>
              <description>Asserted if zeroized fuse word is detetced.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_FUSE_ACCESS_ERR</name>
              <description>Asserted if fuse read/prog operation occurs when lmda_ocotp_no_fuse_access equal to 1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_RELOAD_REQ_ERR</name>
              <description>Asserted if reload operation occurs when lmda_ocotp_no_reload equal to 1.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_WRITE_DURING_RELOAD_ERR</name>
              <description>Asserted if writing operation occurs during reload.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_SHADOW_HVF_READ_ERR</name>
              <description>Asserted if shadow hvf read error is generated.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_SHADOW_HVF_WRITE_ERR</name>
              <description>Asserted if shadow hvf write error is generated.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_SHADOW_SRAM_READ_ERR</name>
              <description>Asserted if shadow sram read error is generated.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_SHADOW_SRAM_WRITE_ERR</name>
              <description>Asserted if shadow sram write error is generated.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_FUSE_READ_ERR</name>
              <description>Asserted if fuse read error is generated.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_FUSE_PROG_ERR</name>
              <description>Asserted if fuse prog error is generated.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK_SHADOW_NO_ACCESS</name>
              <description>asserted if access non-exist shadow register with mask.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
