Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core0.xml
        <register>
          <name>RANGE_STAT</name>
          <description>MICFIL Range Status</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>RANGEOVF0</name>
              <description>Channel 0 Range Overflow Error Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF1</name>
              <description>Channel 1 Range Overflow Error Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF2</name>
              <description>Channel 2 Range Overflow Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF3</name>
              <description>Channel 3 Range Overflow Error Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF4</name>
              <description>Channel 4 Range Overflow Error Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF5</name>
              <description>Channel 5 Range Overflow Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF6</name>
              <description>Channel 6 Range Overflow Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF7</name>
              <description>Channel 7 Range Overflow Error Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF0</name>
              <description>Channel 0 Range Underflow Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF1</name>
              <description>Channel 1 Range Underflow Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF2</name>
              <description>Channel 2 Range Underflow Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF3</name>
              <description>Channel 3 Range Underflow Error Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF4</name>
              <description>Channel 4 Range Underflow Error Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF5</name>
              <description>Channel 5 Range Underflow Error Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF6</name>
              <description>Channel 6 Range Underflow Error Flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF7</name>
              <description>Channel 7 Range Underflow Error Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSYNC_CTRL</name>
          <description>Frame Synchronization Control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSYNCLEN</name>
              <description>Frame Synchronization Window Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2160000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
