Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core0.xml
        <register>
          <name>LDOVDD2VSEL</name>
          <description>LDO VDD2 Voltage Selection</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2C241C14</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSEL0</name>
              <description>LDO VDD2 Voltage Level 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSEL1</name>
              <description>LDO VDD2 Voltage Level 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSEL2</name>
              <description>LDO VDD2 Voltage Level 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSEL3</name>
              <description>LDO VDD2 Voltage Level 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOVDD1VSEL</name>
          <description>LDO VDD1 Voltage Selection</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2C241C14</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSEL0</name>
              <description>LDO VDD1 Voltage Level 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSEL1</name>
              <description>LDO VDD1 Voltage Level 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSEL2</name>
              <description>LDO VDD1 Voltage Level 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSEL3</name>
              <description>LDO VDD1 Voltage Level 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSEL_0</name>
                  <description>0.45 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_1</name>
                  <description>0.65 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_2</name>
                  <description>0.85 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_3</name>
                  <description>1.05 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_4</name>
                  <description>1.15 V (maximum)</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSEL_5</name>
                  <description>1.15 V (clipped)</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LVDVDDNCTRL</name>
          <description>VDDN LVD Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2C28</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVL0</name>
              <description>LVD Level 0 Voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL1</name>
              <description>LVD Level 1 Voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LVDVDD2CTRL</name>
          <description>VDD2 LVD Control</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x281E140A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVL0</name>
              <description>LVD Level 0 Voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL1</name>
              <description>LVD Level 1 Voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL2</name>
              <description>LVD Level 2 Voltage</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL3</name>
              <description>LVD Level 3 Voltage</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
