Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core0.xml
        <register>
          <name>DEBUG1</name>
          <description>UTMI Debug Status 1</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENTAILADJVD</name>
              <description>HS RX Squelch Rise Time Delay Trim</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENV_RT_NOMINAL</name>
                  <description>Squelch rising edge delay is nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENV_RT_1P2X</name>
                  <description>+20% delay compared to nominal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENV_RT_0P8X</name>
                  <description>-20% delay compared to nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENV_RT_0P6X</name>
                  <description>-40% delay compared to nominal</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB2_REFBIAS_SELFBIASOFF</name>
              <description>Self-Bias Off for Reference Bias Amplifiers and Comparators</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Self-bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Current reference bias</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB2_REFBIAS_PWDVBGUP</name>
              <description>Bandgap Voltage Status Comparator Powerdown</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBGUP_CMP_ENABLE</name>
                  <description>Enables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBGUP_CMP_DISABLE</name>
                  <description>Disables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB2_REFBIAS_LOWPWR</name>
              <description>Reference Bias Low Power Configuration</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIAS_NOM</name>
                  <description>Nominal bias current</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIAS_50</name>
                  <description>50% of nominal bias current</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB2_REFBIAS_VBGADJ</name>
              <description>Bandgap Voltage Adjustment</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_NOM</name>
                  <description>Nominal bandgap voltage; flattest temperature coefficient</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_P10</name>
                  <description>+10 mV compared to nominal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_P20</name>
                  <description>+20 mV compared to nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_P30</name>
                  <description>+30 mV compared to nominal; most-positive temperature coefficient</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_M10</name>
                  <description>-10 mV compared to nominal</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_M20</name>
                  <description>-20 mV compared to nominal</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_M30</name>
                  <description>-30 mV compared to nominal</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_M40</name>
                  <description>-40 mV compared to nominal; most-negative temperature coefficient</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB2_REFBIAS_TST</name>
              <description>Bias Current Control Adjustment</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IREF_NOMINAL</name>
                  <description>10 uA reference current; nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF_0P9X</name>
                  <description>0.9x compared to nominal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF_0P8X</name>
                  <description>0.8x compared to nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF_1P1X</name>
                  <description>1.1x compared to nominal</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG1_SET</name>
          <description>UTMI Debug Status 1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>ENTAILADJVD</name>
              <description>HS RX Squelch Rise Time Delay Trim</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_SELFBIASOFF</name>
              <description>Self-Bias Off for Reference Bias Amplifiers and Comparators</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_PWDVBGUP</name>
              <description>Bandgap Voltage Status Comparator Powerdown</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_LOWPWR</name>
              <description>Reference Bias Low Power Configuration</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_VBGADJ</name>
              <description>Bandgap Voltage Adjustment</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_TST</name>
              <description>Bias Current Control Adjustment</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG1_CLR</name>
          <description>UTMI Debug Status 1</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>ENTAILADJVD</name>
              <description>HS RX Squelch Rise Time Delay Trim</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_SELFBIASOFF</name>
              <description>Self-Bias Off for Reference Bias Amplifiers and Comparators</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_PWDVBGUP</name>
              <description>Bandgap Voltage Status Comparator Powerdown</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_LOWPWR</name>
              <description>Reference Bias Low Power Configuration</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_VBGADJ</name>
              <description>Bandgap Voltage Adjustment</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_TST</name>
              <description>Bias Current Control Adjustment</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG1_TOG</name>
          <description>UTMI Debug Status 1</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>ENTAILADJVD</name>
              <description>HS RX Squelch Rise Time Delay Trim</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_SELFBIASOFF</name>
              <description>Self-Bias Off for Reference Bias Amplifiers and Comparators</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_PWDVBGUP</name>
              <description>Bandgap Voltage Status Comparator Powerdown</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_LOWPWR</name>
              <description>Reference Bias Low Power Configuration</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_VBGADJ</name>
              <description>Bandgap Voltage Adjustment</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>USB2_REFBIAS_TST</name>
              <description>Bias Current Control Adjustment</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>USBPHY Version</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x5000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP</name>
              <description>Step</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
