Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>USBNC0</name>
      <description>USBNC</description>
      <groupName>USBNC</groupName>
      <baseAddress>0x40418200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xAC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL1</name>
          <description>USB Control 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OVER_CUR_DIS</name>
              <description>Overcurrent Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVRCRNT_DETCT_EN</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRCRNT_DETCT_DIS</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVER_CUR_POL</name>
              <description>Overcurrent Polarity</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_HI_OVRCRNT</name>
                  <description>Active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LOW_OVRCRNT</name>
                  <description>Active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWR_POL</name>
              <description>Power Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_LO_PMIC</name>
                  <description>Active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_HI_PMIC</name>
                  <description>Active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIE</name>
              <description>Wake-Up Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_SW_EN</name>
              <description>Software Wake-Up Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_WKUP_DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WKUP_EN</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_SW</name>
              <description>Software Wake-Up</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_WKUP</name>
                  <description>Force wake-up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_VBUS_EN</name>
              <description>Wake-Up After VBUS Change Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKUP_VBUS_DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUP_VBUS_EN</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REMOTE_WAKEUP_EN</name>
              <description>Remote Wake-Up Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REMOTE_WKUP_DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE_WKUP_EN</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_DPDM_EN</name>
              <description>Wake-Up After DP or DM Change Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPDM_WKUP_DIS</name>
                  <description>Disable only when VBUS is invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPDM_WKUP_EN</name>
                  <description>Enable (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIR</name>
              <description>Wake-Up Interrupt Request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WKUP_REQ</name>
                  <description>Not received</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUP_REQ</name>
                  <description>Received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>USB Control 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xDF000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>VBUS Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VALID</name>
                  <description>vbus_valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESS_VALID_1</name>
                  <description>sess_valid</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESS_VALID_2</name>
                  <description>sess_valid</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESS_VALID_3</name>
                  <description>sess_valid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UTMI_CLK_VLD</name>
              <description>UTMI Clock Valid Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NOTVALID</name>
                  <description>Not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_CSR0</name>
          <description>USB LPM Control and Status 0</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_EN</name>
              <description>Link Power Management Feature Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_EN0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_EN1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_ERRATA_EN</name>
              <description>Link Power Management ECN Errata Feature Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_ERRATA_EN0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_ERRATA_EN1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_AUTO_PHCD</name>
              <description>Auto Low-Power Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_AUTO_PHCD0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_AUTO_PHCD1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_RESUMEOK</name>
              <description>LPM Resume OK</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_RESUMEOK0</name>
                  <description>Cannot resume</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_RESUMEOK1</name>
                  <description>Can resume</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_L1_ACTIVE</name>
              <description>LPM Active</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_L1_ACTIVE0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_L1_ACTIVE1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_CSR1</name>
          <description>USB LPM Control and Status 1</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_DEV_BESLTHRES</name>
              <description>Device Required Host Initiated Resume Duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES0</name>
                  <description>75 us, if LPM_ERRATA_EN = 1; 50 us, if LPM_ERRATA_EN = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES1</name>
                  <description>100 us, if LPM_ERRATA_EN = 1; 125 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES2</name>
                  <description>150 us, if LPM_ERRATA_EN = 1; 200 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES3</name>
                  <description>250 us, if LPM_ERRATA_EN = 1; 275 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES4</name>
                  <description>350 us, if LPM_ERRATA_EN = 1; 350 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES5</name>
                  <description>450 us, if LPM_ERRATA_EN = 1; 425 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES6</name>
                  <description>950 us, if LPM_ERRATA_EN = 1; 500 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES7</name>
                  <description>1950 us, if LPM_ERRATA_EN = 1; 575 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES8</name>
                  <description>2950 us, if LPM_ERRATA_EN = 1; 650 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES9</name>
                  <description>3950 us, if LPM_ERRATA_EN = 1; 725 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESA</name>
                  <description>4950 us, if LPM_ERRATA_EN = 1; 800 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESB</name>
                  <description>5950 us, if LPM_ERRATA_EN = 1; 875 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESC</name>
                  <description>6950 us, if LPM_ERRATA_EN = 1; 950 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESD</name>
                  <description>7950 us, if LPM_ERRATA_EN = 1; 1025 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESE</name>
                  <description>8950 us, if LPM_ERRATA_EN = 1; 1100 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESF</name>
                  <description>9950 us, if LPM_ERRATA_EN = 1; 1175 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_RES</name>
              <description>LPM Device Response</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_RES0</name>
                  <description>Fourth condition not needed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RES1</name>
                  <description>Fourth condition needed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_DP</name>
              <description>LPM Device Data Pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_DP0</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_DP1</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_RSPSTS</name>
              <description>LPM Device Response Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS0</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS1</name>
                  <description>ACK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS2</name>
                  <description>NYET</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS3</name>
                  <description>STALL</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_RWKENRCVD</name>
              <description>LPM Device Received bRemoteWake</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_RWKENRCVD0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RWKENRCVD1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_LNKSTRCVD</name>
              <description>LPM Device Received bLinkState</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_LNKSTRCVD1</name>
                  <description>L1 (Sleep mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_BESLRCVD</name>
              <description>LPM Device Received BESL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
